{
    "React": {
        "notes": "This is one of my strongest skills, as is most of JavaScript oriented programming languages.",
        "experience": "React",
        "skillLevel": "4",
        "code": [
            ""
        ]
    },
    "React-Redux": {
        "notes": "Hardly my favorite, and there is a reason why. This was my first project completed as a bright-eyed bushy-tailed student at the Flatiron Academy. I love this project, as it represents a beacon of my beginnings to a real beginning. Looking back at it now, I remember how difficult and foreign the world of coding and its many languages was to me the first week into the full time program. The CLI program is designed to play a 5 v 5 basketball game in which the player who is running the app can make substituions after each period. Prior to starting the game, the user is able to decide which squad to pick. I think this project is meaningful to me because it showcases the elegance and power of programming. I explored web-scraping for the first time. For a reasonable 176 kb of space on my computer, a few lines of codes allows me to fetch over twenty years of NBA statistics, down to the game by game performance.",
        "experience": "React - Redux",
        "skillLevel": "3",
        "code": [
            ""
        ]
    },
    "JavaScript": {
        "notes": "Dare I say that 'I love JavaScript'? When I built my first POJ (Plain Ol Javascript) project, I remember taking away two important lessons as a developer. The first, you can literally do anything with JavaScript. The second, make it a requirement to have structure. After 500 lines of js it get's fairly hazy; after 2000 lines, what is happening? There is no order to the asynchronous functionality of JS functions.",
        "experience": "Projects, repl, webscraping, interactive styling",
        "skillLevel": "5",
        "code": []
    },
    "NextJS": {
        "notes": "NextJS is the first technology I learned after graduating from the Flatiron Academy. My first freelance job was to maintain a site built on the NextJS framework. When I learned React, I thought the toughest part to control as a developer is the routing. This framework was beyond a welcome guest in my basket of technologies because it makes me a far better React coder. ",
        "experience": "NextJS site maintenance, personal project builds",
        "skillLevel": "5",
        "code": [
            ""
        ]
    },
    "Nokogiri": {
        "notes": "This is what I thought I could do before ever getting into coding.",
        "experience": "Formatted notes from Flatiron using InDesign and Nokogiri.",
        "skillLevel": "3",
        "code": [
            ""
        ]
    },
    "D3": {
        "notes": "I will spend the rest of my life mastering this library. Before I got into coding, I would attempt to use Adobe Illustrator to create SVG files, export them and manually trim the source code and change the data points that are responsible for creating the SVG paths.",
        "experience": "My Golf App",
        "skillLevel": "2",
        "code": [
            ""
        ]
    },
    "Ruby on Rails": {
        "notes": "This tech was significant for me as a developer because I was able to wrap my head around the powers of the command line interface, scaffolding, persisting data to backend data store with PostgreSQL.",
        "experience": "Ruby, rails, postgres, query language",
        "skillLevel": "3",
        "code": [
            ""
        ]
    },
    "Syngnency CMS": {
        "notes": "I have used this before.",
        "experience": "NextJS",
        "skillLevel": "3",
        "code": [
            ""
        ]
    },
    "Kerby": {
        "notes": "I have used this before.",
        "experience": "NextJS",
        "skillLevel": "3",
        "code": [
            ""
        ]
    },
    "AnimeJS": {
        "notes": "I have used this before.",
        "experience": "NextJS",
        "skillLevel": "3",
        "code": [
            ""
        ]
    },
    "Sinatra": {
        "notes": "I have used this before.",
        "experience": "Ruby",
        "skillLevel": "3",
        "code": [
            ""
        ]
    }
}